Autodesk.Revit.DB.Mechanical.DuctFlowConfigurationType
An enumerated type listing all duct flow configuration types for a connector.

Autodesk.Revit.DB.Mechanical.DuctFlowConfigurationType.System
Duct flow configuration depends on system.

Autodesk.Revit.DB.Mechanical.DuctFlowConfigurationType.Preset
Duct flow configuration is preset.

Autodesk.Revit.DB.Mechanical.DuctFlowConfigurationType.Calculated
Duct flow configuration is calculated.